## MongoDB

### Setup

In [1]:
import pandas as pd
from pymongo import MongoClient
client = MongoClient('localhost',27017) 
db = client.apan5400

In [2]:
mongo_df = pd.read_csv('car_prices.csv')

### Create a collection and insert data

In [3]:
cars = db['collection_car']
db['cars'].drop()

In [4]:
cars = db['cars']

In [5]:
# Convert the DataFrame to a dictionary
cars.insert_many(mongo_df.to_dict('records'));

### Total vehicle production each year

In [6]:
pipeline = [
    {"$group": {"_id": "$year", "total_production": {"$sum": 1}}},
    {"$project": {"year": "$_id", "total_production": 1, "_id": 0}},
]

In [7]:
result = list(cars.aggregate(pipeline))
df1 = pd.DataFrame(result)
df1 = df1[['year', 'total_production']]
df1

    year  total_production
0   1998              2149
1   1997              1546
2   1989                20
3   1991                67
4   2014             81070
5   1983                 1
6   2015              9437
7   1982                 2
8   1994               392
9   1990                49
10  2001              6468
11  1992               132
12  2011             48548
13  1993               205
14  1984                 5
15  2004             17342
16  2006             26913
17  1999              3363
18  2009             20594
19  2010             26485
20  2012            102315
21  2005             21394
22  2013             98168
23  1986                11
24  2000              5227
25  2007             30845
26  2003             13281
27  1996               851
28  1988                11
29  2002              9715
30  1987                 8
31  2008             31502
32  1995               711
33  1985                10

### Top 10 model that sold the most units over time

In [8]:
pipeline = [
    {"$group": {"_id": "$model", "model_count": {"$sum": 1}}},
    {"$match": {"model_count": {"$gt": 1000}}},
    {"$sort": {"model_count": -1}},
    {"$project": {"model": "$_id", "model_count": 1, "_id": 0}},
    {"$limit": 10}
]

In [9]:
result = list(cars.aggregate(pipeline))
df2 = pd.DataFrame(result)
df2 = df2[['model','model_count']]
df2

           model  model_count
0         Altima        19349
1          F-150        14479
2         Fusion        12946
3          Camry        12545
4         Escape        11861
5            NaN        10399
6          Focus        10394
7         Accord         9127
8       3 Series         8204
9  Grand Caravan         7941

### Top 10 brand (make) that generated the most total sales

In [10]:
pipeline = [
    {"$group": {"_id": "$make", "total_sales": {"$sum": "$sellingprice"}}},
    {"$project": {"make": "$_id", "total_sales": 1, "_id": 0}},
    {"$sort": {"total_sales": -1}},
    {"$limit": 10}
]

In [11]:
result = list(cars.aggregate(pipeline))
df3 = pd.DataFrame(result)
df3 = df3[['make','total_sales']]
df3

            make  total_sales
0      Chevrolet  721003399.0
1         Nissan  633272955.0
2         Toyota  488392710.0
3            BMW  444254638.0
4  Mercedes-Benz  370083906.0
5       Infiniti  312489190.0
6          Honda  297645409.0
7          Lexus  240615055.0
8           Jeep  230583753.0
9            GMC  179905320.0

In [12]:
pipeline = [
    {"$match": {"make": {"$in": ["Nissan", "Toyota", "Honda"]}}},
    {"$group": {
        "_id": {"make": "$make", "year": "$year"},
        "total_units": {"$sum": 1},
        "total_sales": {"$sum": "$sellingprice"}
    }},
    {"$project": {
        "_id": 0,
        "make": "$_id.make",
        "year": "$_id.year",
        "total_units": 1,
        "total_sales": 1
    }},
    {"$sort": {"make": 1, "year": 1}}
]

In [13]:
result = list(cars.aggregate(pipeline))
df4 = pd.DataFrame(result)
pd.set_option('display.max_rows', None)
df4 = df4[['make','year','total_units','total_sales']]
df4

      make  year  total_units  total_sales
0    Honda  1990           10       4100.0
1    Honda  1991           10       3575.0
2    Honda  1992           22      13725.0
3    Honda  1993           26      16125.0
4    Honda  1994           68      46750.0
5    Honda  1995           70      54150.0
6    Honda  1996           88      68925.0
7    Honda  1997          197     182100.0
8    Honda  1998          283     351200.0
9    Honda  1999          310     456350.0
10   Honda  2000          428     711525.0
11   Honda  2001          565    1043975.0
12   Honda  2002          743    1654000.0
13   Honda  2003         1166    3595675.0
14   Honda  2004          931    3267700.0
15   Honda  2005         1031    4636095.0
16   Honda  2006         1078    6058675.0
17   Honda  2007         1621   11255250.0
18   Honda  2008         1669   13777975.0
19   Honda  2009         1246   12172350.0
20   Honda  2010         1402   15163360.0
21   Honda  2011         1738   24222075.0
22   Honda  2012         8684  127370100.0
23   Honda  2013         2537   45468179.0
24   Honda  2014         1206   24352425.0
25   Honda  2015           77    1699050.0
26  Nissan  1990            3       4000.0
27  Nissan  1991            2        950.0
28  Nissan  1992            1        350.0
29  Nissan  1993            7       3275.0
30  Nissan  1994           11       6550.0
31  Nissan  1995           44      25350.0
32  Nissan  1996           72      45750.0
33  Nissan  1997          103      82200.0
34  Nissan  1998          111     101150.0
35  Nissan  1999          125     125300.0
36  Nissan  2000          304     460959.0
37  Nissan  2001          286     512025.0
38  Nissan  2002          559    1200150.0
39  Nissan  2003          724    1939575.0
40  Nissan  2004         1176    4510775.0
41  Nissan  2005         1733    7454705.0
42  Nissan  2006         1761    9074100.0
43  Nissan  2007         1777   10451800.0
44  Nissan  2008         1454   10463595.0
45  Nissan  2009         1320   11512000.0
46  Nissan  2010         1576   16249650.0
47  Nissan  2011         5917   78784489.0
48  Nissan  2012        16879  220186128.0
49  Nissan  2013        11726  164015011.0
50  Nissan  2014         5652   85775268.0
51  Nissan  2015          623   10287850.0
52  Toyota  1990            8       3225.0
53  Toyota  1991           15       6050.0
54  Toyota  1992           31      19850.0
55  Toyota  1993           48      30925.0
56  Toyota  1994           60      46075.0
57  Toyota  1995          117      87900.0
58  Toyota  1996          133     128325.0
59  Toyota  1997          182     272300.0
60  Toyota  1998          273     387800.0
61  Toyota  1999          340     583075.0
62  Toyota  2000          425     937475.0
63  Toyota  2001          464    1372575.0
64  Toyota  2002          760    2615850.0
65  Toyota  2003          986    4176475.0
66  Toyota  2004         1224    6125150.0
67  Toyota  2005         1344    7215600.0
68  Toyota  2006         1525    9897125.0
69  Toyota  2007         2101   15990775.0
70  Toyota  2008         1707   17477225.0
71  Toyota  2009         1873   16114180.0
72  Toyota  2010         2137   23949630.0
73  Toyota  2011         4132   59032606.0
74  Toyota  2012         7230  110507745.0
75  Toyota  2013         6706  106394859.0
76  Toyota  2014         5813  100445105.0
77  Toyota  2015          237    4574810.0

### Flask

In [14]:
import pandas as pd
!pip install Flask pymongo

Requirement already satisfied: Flask in c:\users\kevin\anaconda3\lib\site-packages (2.2.5)
Requirement already satisfied: pymongo in c:\users\kevin\anaconda3\lib\site-packages (4.6.2)
Requirement already satisfied: Werkzeug>=2.2.2 in c:\users\kevin\anaconda3\lib\site-packages (from Flask) (2.2.3)
Requirement already satisfied: Jinja2>=3.0 in c:\users\kevin\anaconda3\lib\site-packages (from Flask) (3.1.3)
Requirement already satisfied: itsdangerous>=2.0 in c:\users\kevin\anaconda3\lib\site-packages (from Flask) (2.0.1)
Requirement already satisfied: click>=8.0 in c:\users\kevin\anaconda3\lib\site-packages (from Flask) (8.1.7)
Requirement already satisfied: dnspython<3.0.0,>=1.16.0 in c:\users\kevin\anaconda3\lib\site-packages (from pymongo) (2.6.1)
Requirement already satisfied: colorama in c:\users\kevin\anaconda3\lib\site-packages (from click>=8.0->Flask) (0.4.6)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\kevin\anaconda3\lib\site-packages (from Jinja2>=3.0->Flask) (2.1.3)

In [15]:
df = pd.read_csv('car_prices.csv')

In [16]:
from flask import Flask, request, render_template_string
from pymongo import MongoClient

In [17]:
import json
# Convert the data frame into a list of JSON objects
json_list = df.to_json(orient='records')
json_list = json.loads(json_list)

In [18]:
len(json_list)

558837

In [19]:
# Write all JSON objects into a text (JSON string) file
with open('json_string', 'w') as json_string_file:
    json.dump(json_list, json_string_file)

In [20]:
# Print the number of records in the resulting file
with open('json_string', 'r') as file:
    json_file = json.load(file)
len(json_file)

558837

In [21]:
# Load JSON data into a DataFrame
json_df = pd.DataFrame(json_file)

In [22]:
app = Flask('5400_Group_project_1_Web')

In [23]:
# Select all BMW vehicles sold in 2014
df_bmw_2014 = json_df[(json_df['make'] == 'BMW') & (json_df['year'] == 2014)]
bmw_list = df_bmw_2014.values.tolist()

In [24]:
# router
@app.route('/bmw')
def bmw_cars():
    output = df_bmw_2014.to_html()
    return output

In [ ]:
app.run(host='localhost', port=5001)

 * Serving Flask app '5400_Group_project_1_Web'
 * Debug mode: off

WARNING: This is a development server. Do not use it in a production deployment. Use a production WSGI server instead.
 * Running on http://localhost:5001
Press CTRL+C to quit
127.0.0.1 - - [17/Apr/2024 18:22:10] "GET / HTTP/1.1" 404 -
127.0.0.1 - - [17/Apr/2024 18:22:10] "GET /favicon.ico HTTP/1.1" 404 -
127.0.0.1 - - [17/Apr/2024 18:22:15] "GET /bmw HTTP/1.1" 200 -